In [7]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [8]:
data = pd.read_csv(r'C:\Users\user\Downloads\StudentsPerformance.csv')

In [9]:
data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

In [10]:
data.shape

(1000, 8)

In [11]:
data.describe()

        math score  reading score  writing score
count  1000.000000    1000.000000    1000.000000
mean     66.001000      69.195000      68.119000
std      15.569567      14.706436      15.226381
min       0.000000      17.000000      10.000000
25%      57.000000      59.000000      58.000000
50%      66.000000      70.000000      69.000000
75%      77.000000      79.250000      79.000000
max     100.000000     100.000000     100.000000

In [12]:
data.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

# 1. Males and Females participated in the test

In [13]:
data['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

# 2.Students Parental Level of Education

In [14]:
data['parental level of education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

# 3.Who scores most based on gender and test preparation course

In [15]:
data.groupby(['gender', 'test preparation course']).mean()[['math score','reading score','writing score']]

C:\Users\user\AppData\Local\Temp\ipykernel_1548\91034744.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  data.groupby(['gender', 'test preparation course']).mean()[['math score','reading score','writing score']]

                                math score  reading score  writing score
gender test preparation course
female completed                 67.108696      77.375000      78.793478
       none                      61.320359      69.955090      68.982036
male   completed                 72.988506      70.793103      70.339080
       none                      66.467532      62.581169      59.551948

# 4.Scoring variation based on gender and test preparation course

In [16]:
data.groupby(['gender', 'test preparation course']).std()[['math score','reading score','writing score']]

C:\Users\user\AppData\Local\Temp\ipykernel_1548\1164517533.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  data.groupby(['gender', 'test preparation course']).std()[['math score','reading score','writing score']]

                                math score  reading score  writing score
gender test preparation course
female completed                 14.428233      12.695493      12.240788
       none                      16.510686      14.636981      15.016497
male   completed                 14.039164      13.612420      12.887910
       none                      14.335746      13.595718      13.468284

# 5.Bonus point to top 25% Students

In [17]:
top_students = data[data['math score']>= data['math score'].quantile(.75)]

In [18]:
top_students

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
414,female,group A,high school,free/reduced,completed,77,88,85
415,female,group B,master's degree,free/reduced,completed,77,97,94
416,female,group B,bachelor's degree,free/reduced,none,77,85,87
417,female,group B,master's degree,standard,none,77,90,84
418,female,group B,high school,standard,completed,77,82,89
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

# Adding bonus points

In [19]:
top_students.loc[:,'math score'] + 10

414     87
415     87
416     87
417     87
418     87
      ...
995    109
996    110
997    110
998    110
999    110
Name: math score, Length: 255, dtype: int64